lectures/lecture_constructeur.org
#+TITLE:  Notions de constructeur et de destructeur
#+AUTHOR: Xavier Garrido
#+DATE:   23/09/2013
#+OPTIONS: toc:nil ^:{}
#+LATEX_HEADER: \setcounter{chapter}{5}

Le constructeur et le destructeur sont deux *méthodes* particulières qui sont
appelées respectivement à la création et à la destruction d'un objet. Toute
classe a un constructeur et un destructeur par défaut, fournis par le
compilateur. Toutefois, il est souvent nécessaire de les redéfinir afin de gérer
certaines actions (initialisation des membres, appel de méthodes...) qui doivent
avoir lieu lors de la création d'un objet puis lors de sa destruction. À titre
d'exemple, si l'objet contient des variables allouées dynamiquement, il faut
leur réserver de la mémoire à la création de l'objet ou, à défaut, mettre les
pointeurs correspondants à =0= (ou =NULL=). À la destruction de l'objet, il convient
de restituer la mémoire éventuellement allouée.

