doc/lectures/lecture_constructeur.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Notions de constructeur et de destructeur</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="lecture_pointeur.html">Pointeurs, références & allocation dynamique </a><a href="lecture_fonction.html">Rappels sur les fonctions </a><a href="lecture_specificite_c++.html">Les spécificités du C++ </a><a href="lecture_struct_class.html">Structures et classes </a><a href="lecture_encapsulation.html">Encapsulation des données </a><a href="lecture_constructeur.html">Notions de constructeur et de destructeur </a><a href="lecture_amitie.html">Fonctions et classes amies </a><a href="lecture_surcharge.html">Surcharge d'opérateur </a><a href="lecture_heritage.html">Héritage </a><a href="lecture_template.html">Notions de patrons de fonctions et de classes </a><a href="lecture_librairie_standard.html">Introduction à la librairie standard STL </a><a href=""></a><hr/><a href="annexe_compilation.html">Compilation et directives de préprocesseur </a><a href="annexe_convention_ecriture.html">Convention d'écriture et organisation des programmes </a><a href="annexe_cout_cin.html">Écriture/lecture sur l'entrée/sortie standard </a><a href="annexe_variable_statique.html">Les membres données statiques </a><a href="annexe_enum_typedef.html">Utilisation de enum et de typedef </a>
                    <hr/>
                    <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Notions de constructeur et de destructeur</h1><hr/>
<p>
Le constructeur et le destructeur sont deux <b>méthodes</b> particulières qui sont
appelées respectivement à la création et à la destruction d&rsquo;un objet. Toute
classe a un constructeur et un destructeur par défaut, fournis par le
compilateur. Toutefois, il est souvent nécessaire de les redéfinir afin de gérer
certaines actions (initialisation des membres, appel de méthodes&#x2026;) qui doivent
avoir lieu lors de la création d&rsquo;un objet puis lors de sa destruction. À titre
d&rsquo;exemple, si l&rsquo;objet contient des variables allouées dynamiquement, il faut
leur réserver de la mémoire à la création de l&rsquo;objet ou, à défaut, mettre les
pointeurs correspondants à <code>0</code> (ou <code>NULL</code>). À la destruction de l&rsquo;objet, il convient
de restituer la mémoire éventuellement allouée.
</p>
