lectures/lecture_constructeur.org
* Définition des constructeurs et des destructeurs

Le constructeur se définit comme une méthode à part entière. Cependant, pour que
le compilateur puisse la considérer en tant que telle, les deux conditions
suivantes doivent être validées :

- le constructeur doit porter *le même nom* que la classe,

- le constructeur ne doit avoir *aucun type*, =void= compris.

Considérons la classe =point= précédemment utilisée. La fonction membre
=initialise= est naturellement remplacée par un constructeur, c'est-à-dire par
une méthode dépourvue de type et nommée =point=. La déclaration de cette classe
devient alors

#+BEGIN_SRC c++
  class point
  {
  private :
    int m_X;
    int m_Y;

  public :
    point(int abs, int ord); // Constructeur de la classe point
  };
#+END_SRC
La définition du constructeur reste identique à celle de la méthode
=initialise=, à savoir l'assignation de la valeur =abs=, respectivement =ord=,
au membre =m_X=, respectivement =m_Y=, mais le prototype s'écrit

#+BEGIN_SRC c++
  point::point(int abs, int ord) { m_X = abs; m_Y = ord; }
#+END_SRC

#+BEGIN_REMARK
Lors de la construction d'un objet, il est recommandé *d'initialiser* les
membres au travers du constructeur plutôt que *d'assigner* leurs
valeurs. Autrement dit, à l'assignation =m_X = abs; m_Y = ord=, on préférera
l'initialisation suivante
#+BEGIN_SRC c++
  point::point(int abs, int ord) : m_X(abs), m_Y(ord) {}
#+END_SRC
Cette possibilité devient indispensable en cas :

- d'initialisation d'un membre constant,
- d'initialisation d'un membre qui est une référence.
#+END_REMARK

Le destructeur doit respecter les mêmes règles que le constructeur sachant que
son nom est toujours précédé du signe tilde. Comme nous l'avons souligné en
introduction, l'utilisation d'un destructeur est naturelle lors de la libération
de l'espace mémoire alloué. Supposons l'ajout d'un pointeur de caractère =char
*p_geometry_type= (portant sur le type de géométrie mis en jeu, euclidienne par
exemple) à la classe =point=. La déclaration de la classe =point= devient

#+BEGIN_SRC c++
  class point
  {
  private :
    ...
    char *p_geometry_type;

  public :
    point();
    point(int abs, int ord);
    ~point(); // Destructeur de la classe point
  };
#+END_SRC
tandis que la restitution de la mémoire allouée pour =p_geometry_type= se
formalise de la façon suivante

#+BEGIN_SRC c++
  point::~point() { delete[] p_geometry_type; }
#+END_SRC

Le constructeur est appelé après l'allocation de la mémoire de l'objet alors que
le destructeur est appelé avant la libération de cette mémoire. La gestion de
l'allocation dynamique de mémoire avec les classes est ainsi simplifiée. Par
ailleurs, les constructeurs peuvent avoir des paramètres. Ils peuvent donc être
surchargés (/cf./  fiche sur les spécificités du \Cpp), à la différence des
destructeurs qui n'ont jamais d'arguments. Cela tient au fait qu'en général, le
contexte dans lequel un objet est crée, est connu ce qui n'est pas le cas lors
de sa destruction : il n'existe donc qu'un seul destructeur pour une classe
donnée. La classe =point= peut ainsi proposer plusieurs constructeurs, l'appel
se faisant suivant le contexte, c'est-à-dire suivant l'instanciation d'un objet
=point=. On pourra imaginer ainsi la déclaration suivante
#+BEGIN_SRC c++
  class point
  {
  private :
    int m_X;
    int m_Y;
    char *p_geometry_type;

  public :
    point();
    point(int abs, int ord);
    point(int abs, int ord, unsigned int n_size);
    ~point();
  };
#+END_SRC
où les constructeurs sont définis ainsi
#+BEGIN_SRC c++
  // Constructeur par défaut
  point::point() : m_X(0), m_Y(0), p_geometry_type(0) {}

  // Simple initialisation des coordonnées
  point::point(int abs, int ord) : m_X(abs), m_Y(ord), p_geometry_type(0) {}

  // Initialisation des coordonées et allocation dynamique
  point::point(int abs, int ord, unsigned int n_size) :
    m_X(abs), m_Y(ord), p_geometry_type(new char[n_size + 1]) {}
#+END_SRC
Selon le besoin, l'utilisateur de la classe choisira l'un des constructeurs
précédents lors de la création d'un objet =point=. À titre d'exemple, les
instanciations suivantes seront toutes différentes tout en étant chacune
valables.
#+BEGIN_SRC c++
  point my_point1;            // construction par défaut
  point my_point2(1, 2);      // initialisation des coordonnées
  point my_point3(1, 2, 256); // allocation dynamique pour le pointeur p_geometry_type
#+END_SRC

