doc/lectures/lecture_constructeur.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Définition des constructeurs et des destructeurs</h2>
<div class="outline-text-2" id="text-1">
<p>
Le constructeur se définit comme une méthode à part entière. Cependant, pour que
le compilateur puisse la considérer en tant que telle, les deux conditions
suivantes doivent être validées :
</p>

<ul class="org-ul">
<li>le constructeur doit porter <b>le même nom</b> que la classe,
</li>

<li>le constructeur ne doit avoir <b>aucun type</b>, <code>void</code> compris.
</li>
</ul>

<p>
Considérons la classe <code>point</code> précédemment utilisée. La fonction membre
<code>initialise</code> est naturellement remplacée par un constructeur, c&rsquo;est-à-dire par
une méthode dépourvue de type et nommée <code>point</code>. La déclaration de cette classe
devient alors
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">point</span>
{
<span class="org-keyword">private</span> :
  <span class="org-type">int</span> <span class="org-variable-name">m_X</span>;
  <span class="org-type">int</span> <span class="org-variable-name">m_Y</span>;

<span class="org-keyword">public</span> :
  <span class="org-function-name">point</span> (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">Constructeur de la classe point</span>
};
</pre>
</div>
<p>
La définition du constructeur reste identique à celle de la méthode
<code>initialise</code>, à savoir l&rsquo;assignation de la valeur <code>abs</code>, respectivement <code>ord</code>,
au membre <code>m_X</code>, respectivement <code>m_Y</code>, mais le prototype s&rsquo;écrit
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-constant">point</span>::<span class="org-function-name">point</span> (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>) { m_X = abs; m_Y = ord; }
</pre>
</div>

<div class="remark">
<p>
Lors de la construction d&rsquo;un objet, il est recommandé <b>d&rsquo;initialiser</b> les
membres au travers du constructeur plutôt que <b>d&rsquo;assigner</b> leurs
valeurs. Autrement dit, à l&rsquo;assignation <code>m_X = abs; m_Y = ord</code>, on préférera
l&rsquo;initialisation suivante
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-constant">point</span>::<span class="org-function-name">point</span> (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>) : m_X(abs), m_Y(ord) {}
</pre>
</div>
<p>
Cette possibilité devient indispensable en cas :
</p>

<ul class="org-ul">
<li>d&rsquo;initialisation d&rsquo;un membre constant,
</li>
<li>d&rsquo;initialisation d&rsquo;un membre qui est une référence.
</li>
</ul>

</div>

<p>
Le destructeur doit respecter les mêmes règles que le constructeur sachant que
son nom est toujours précédé du signe tilde. Comme nous l&rsquo;avons souligné en
introduction, l&rsquo;utilisation d&rsquo;un destructeur est naturelle lors de la libération
de l&rsquo;espace mémoire alloué. Supposons l&rsquo;ajout d&rsquo;un pointeur de caractère <code>char
*p_geometry_type</code> (portant sur le type de géométrie mis en jeu, euclidienne par
exemple) à la classe <code>point</code>. La déclaration de la classe <code>point</code> devient
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">point</span>
{
<span class="org-keyword">private</span> :
  ...
  <span class="org-type">char</span> *p_geometry_type;

<span class="org-keyword">public</span> :
  <span class="org-function-name">point</span> ();
  <span class="org-function-name">point</span> (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>);
  ~<span class="org-function-name">point</span> (); <span class="org-comment-delimiter">// </span><span class="org-comment">Destructeur de la classe point</span>
};
</pre>
</div>
<p>
tandis que la restitution de la mémoire allouée pour <code>p_geometry_type</code> se
formalise de la façon suivante
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-constant">point</span>::~<span class="org-function-name">point</span>() { <span class="org-keyword">delete</span>[] p_geometry_type; }
</pre>
</div>

<p>
Le constructeur est appelé après l&rsquo;allocation de la mémoire de l&rsquo;objet alors que
le destructeur est appelé avant la libération de cette mémoire. La gestion de
l&rsquo;allocation dynamique de mémoire avec les classes est ainsi simplifiée. Par
ailleurs, les constructeurs peuvent avoir des paramètres. Ils peuvent donc être
surchargés (<i>cf.</i>  fiche sur les spécificités du C++), à la différence des
destructeurs qui n&rsquo;ont jamais d&rsquo;arguments. Cela tient au fait qu&rsquo;en général, le
contexte dans lequel un objet est crée, est connu ce qui n&rsquo;est pas le cas lors
de sa destruction : il n&rsquo;existe donc qu&rsquo;un seul destructeur pour une classe
donnée. La classe <code>point</code> peut ainsi proposer plusieurs constructeurs, l&rsquo;appel
se faisant suivant le contexte, c&rsquo;est-à-dire suivant l&rsquo;instanciation d&rsquo;un objet
<code>point</code>. On pourra imaginer ainsi la déclaration suivante
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">Point</span>
{
<span class="org-keyword">private</span> :
  <span class="org-type">int</span> <span class="org-variable-name">m_X</span>;
  <span class="org-type">int</span> <span class="org-variable-name">m_Y</span>;
  <span class="org-type">char</span> *<span class="org-variable-name">p_geometry_type</span>;

<span class="org-keyword">public</span> :
  point ();
  point (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>);
  point (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>, <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">n_size</span>);
  ~point ();
};
</pre>
</div>
<p>
où les constructeurs sont définis ainsi
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Constructeur par d&#233;faut</span>
<span class="org-constant">point</span>::<span class="org-function-name">point</span> () : m_X(0), m_Y(0), p_geometry_type(0) {}

<span class="org-comment-delimiter">// </span><span class="org-comment">Simple initialisation des coordonn&#233;es</span>
<span class="org-constant">point</span>::<span class="org-function-name">point</span> (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>) : m_X(abs), m_Y(ord), p_geometry_type(0) {}

<span class="org-comment-delimiter">// </span><span class="org-comment">Initialisation des coordon&#233;es et allocation dynamique</span>
<span class="org-constant">point</span>::<span class="org-function-name">point</span> (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>, <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">n_size</span>) :
  m_X(abs), m_Y(ord), p_geometry_type(<span class="org-keyword">new</span> <span class="org-type">char</span>[n_size + 1]) {}
</pre>
</div>
<p>
Selon le besoin, l&rsquo;utilisateur de la classe choisira l&rsquo;un des constructeurs
précédents lors de la création d&rsquo;un objet <code>point</code>. À titre d&rsquo;exemple, les
instanciations suivantes seront toutes différentes tout en étant chacune
valables.
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">point</span> <span class="org-variable-name">my_point1</span>;             <span class="org-comment-delimiter">// </span><span class="org-comment">construction par d&#233;faut</span>
<span class="org-type">point</span> <span class="org-function-name">my_point2</span> (1, 2);      <span class="org-comment-delimiter">// </span><span class="org-comment">initialisation des coordonn&#233;es</span>
<span class="org-type">point</span> <span class="org-function-name">my_point3</span> (1, 2, 256); <span class="org-comment-delimiter">// </span><span class="org-comment">allocation dynamique pour</span>
                             <span class="org-comment-delimiter">// </span><span class="org-comment">le pointeur p_geometry_type</span>
</pre>
</div>
</div>
