lectures/lecture_constructeur.org
*** Remarques

- Lorsqu'un constructeur se contente d'attribuer des valeurs initiales aux
  données membres, le destructeur est rarement indispensable. En revanche, il le
  devient dés lors que l'objet est amené (par le biais de son constructeur ou
  d'autres fonctions membres) à allouer dynamiquement de la mémoire.

- En théorie, constructeurs et destructeurs peuvent être publics ou privés. En
  pratique, à moins d'avoir de bonnes raisons de faire le contraire, il vaut
  mieux les rendre publics. En effet, un destructeur privé ne pourra pas être
  appelé directement, ce qui dans l'absolu n'est pas dramatique dès lors
  qu'aucune allocation dynamique n'a été nécessaire. En revanche, si le
  constructeur d'une classe est privé, il ne sera plus possible de créer
  d'objets /via/ ce constructeur. Seule exception notable à cette règle, la
  possibilité de déclarer le constructeur par défaut (celui sans argument) comme
  privé, afin d'interdire l'utilisation d'un objet sans avoir explicitement
  initialiser ces valeurs membres. Cette condition assure une plus grande
  robustesse au programme, l'utilisateur devant nécessairement préciser les
  valeurs initiales de chacun des membres de l'objet.

* Objets membres

Il est tout à fait possible qu'une classe possède un membre donnée lui-même de
type classe. Par exemple, la classe =point= préalablement définie, pourra être
un membre d'une classe =cercle= ainsi définie

#+BEGIN_SRC c++
  class cercle
  {
  private:
    point  m_centre;
    double m_rayon;
    ...
  };
#+END_SRC

La situation d'objets membres correspond à une relation entre classes du type
relation de possession. Effectivement, on peut dire qu'un cercle possède un
centre (de type =point=). Ce type de relation s'oppose à la relation de type
"relation est" inhérente à la notion d'héritage (/cf./ Chapitre [[file:lecture_heritage.pdf]["Héritage"]]).

La présence d'un constructeur de classe =point= impose la création d'un
constructeur de classe =cercle=. En effet, en l'absence de constructeur, le
membre =m_centre= se verrait certes attribuer un emplacement en mémoire, mais
son constructeur ne pourrait être appelé. Il est donc nécessaire d'une part de
définir un constructeur pour =cercle= et d'autre part, de spécifier les
arguments à fournir au constructeur de =point=. Le constructeur suivant

#+BEGIN_SRC c++
  class cercle
  {
  private:
    point  m_centre;
    double m_rayon;
  public:
    cercle(int abs, int ord, double rayon);
  };

  cercle::cercle(int abs, int ord, double rayon) : centre(abs, ord), m_rayon(rayon)
  {
    ...
  }
#+END_SRC
propose ainsi une solution. Les constructeurs seront appelés dans l'ordre
suivant: =point=, =cercle= tandis que les destructeurs seront appelés dans
l'ordre inverse.

*** Remarques

Il pourrait être envisagé de définir le constructeur de =cercle= de la façon
suivante:

#+BEGIN_SRC c++
  cercle::cercle(int abs, int ord, double rayon) : m_rayon(rayon)
  {
    centre = point (abs, ord);
    ...
  }
#+END_SRC

Cependant, on créerait alors un objet temporaire de type =point= supplémentaire
provoquant le ralentissement du programme lors de l'exécution (/a fortiori/ si
la classe impliquée est de taille conséquente). En outre, si la classe =point=
dispose de membres dynamiques, =p_geometry_type= par exemple, seules les valeurs
des pointeurs seront recopiées et non leurs emplacements mémoire. Il conviendra
alors de surcharger l'opérateur d'affectation === de telle sorte que les membres
pointeurs soient également affectés (/cf./ Chapitre [[file:lecture_surcharge_operateur.pdf]["Surcharge d'opérateur"]]).

* Les objets dynamiques

Les objets dynamiques, par opposition aux objets automatiques dont la durée de
vie se limite à l'appel d'une fonction ou à la taille d'un bloc (boucle =for=,
par exemple), ne sont explicitement détruits qu'à l'appel de l'opérateur
=delete=. Cette instruction a pour conséquence l'exécution du destructeur de la
classe et donc, la désallocation de l'espace mémoire réservé. En outre, la
déclaration d'objets dynamiques se fait /via/ l'opérateur =new=; le ou les
constructeurs constituent alors le passage obligé lors de la création de
l'objet. Plus précisément, après l'allocation dynamique de l'emplacement mémoire
requis, l'opérateur =new= appellera le constructeur de l'objet adéquat selon la
nature des arguments figurant à la suite de son appel. Ainsi, les déclarations
suivantes

#+BEGIN_SRC c++
  point * ptr_point1 = new point;
  point * ptr_point2 = new point(2,5);
#+END_SRC

permettront soit l'appel du constructeur par défaut (premier cas), soit l'appel
du constructeur initialisant les membres de la classe aux valeurs 2 et 5 (second
cas).

L'accès aux méthodes de l'objet pointé =ptr_point1= ou =ptr_point2= se fera par
des appels de la forme =ptr_point1->affiche();= équivalents aux instructions de
type =(*ptr_point1).affiche();=

Dès lors que l'objet dynamique n'est plus nécessaire, l'utilisation de
l'opérateur =delete=, indissociable de l'opérateur =new=, entrainera alors
l'appel du destructeur de classe.

