doc/lectures/lecture_constructeur.html

<div id="outline-container-sec-1-0-1" class="outline-4">
<h4 id="sec-1-0-1">Remarques</h4>
<div class="outline-text-4" id="text-1-0-1">
<ul class="org-ul">
<li>Lorsqu&rsquo;un constructeur se contente d&rsquo;attribuer des valeurs initiales aux
données membres, le destructeur est rarement indispensable. En revanche, il le
devient dés lors que l&rsquo;objet est amené (par le biais de son constructeur ou
d&rsquo;autres fonctions membres) à allouer dynamiquement de la mémoire.
</li>

<li>En théorie, constructeurs et destructeurs peuvent être publics ou privés. En
pratique, à moins d&rsquo;avoir de bonnes raisons de faire le contraire, il vaut
mieux les rendre publics. En effet, un destructeur privé ne pourra pas être
appelé directement, ce qui dans l&rsquo;absolu n&rsquo;est pas dramatique dès lors
qu&rsquo;aucune allocation dynamique n&rsquo;a été nécessaire. En revanche, si le
constructeur d&rsquo;une classe est privé, il ne sera plus possible de créer
d&rsquo;objets <i>via</i> ce constructeur. Seule exception notable à cette règle, la
possibilité de déclarer le constructeur par défaut (celui sans argument) comme
privé, afin d&rsquo;interdire l&rsquo;utilisation d&rsquo;un objet sans avoir explicitement
initialiser ces valeurs membres. Cette condition assure une plus grande
robustesse au programme, l&rsquo;utilisateur devant nécessairement préciser les
valeurs initiales de chacun des membres de l&rsquo;objet.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Objets membres</h2>
<div class="outline-text-2" id="text-2">
<p>
Il est tout à fait possible qu&rsquo;une classe possède un membre donnée lui-même de
type classe. Par exemple, la classe <code>point</code> préalablement définie, pourra être
un membre d&rsquo;une classe <code>cercle</code> ainsi définie
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">cercle</span>
{
<span class="org-keyword">private</span>:
  <span class="org-type">point</span>  <span class="org-variable-name">m_centre</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_rayon</span>;
  ...
};
</pre>
</div>

<p>
La situation d&rsquo;objets membres correspond à une relation entre classes du type
relation de possession. Effectivement, on peut dire qu&rsquo;un cercle possède un
centre (de type <code>point</code>). Ce type de relation s&rsquo;oppose à la relation de type
&ldquo;relation est&rdquo; inhérente à la notion d&rsquo;héritage (<i>cf.</i> Chapitre <a href="lecture_heritage.html">&ldquo;Héritage&rdquo;</a>).
</p>

<p>
La présence d&rsquo;un constructeur de classe <code>point</code> impose la création d&rsquo;un
constructeur de classe <code>cercle</code>. En effet, en l&rsquo;absence de constructeur, le
membre <code>m_centre</code> se verrait certes attribuer un emplacement en mémoire, mais
son constructeur ne pourrait être appelé. Il est donc nécessaire d&rsquo;une part de
définir un constructeur pour <code>cercle</code> et d&rsquo;autre part, de spécifier les
arguments à fournir au constructeur de <code>point</code>. Le constructeur suivant
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">cercle</span>
{
<span class="org-keyword">private</span>:
  <span class="org-type">point</span>  <span class="org-variable-name">m_centre</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_rayon</span>;
<span class="org-keyword">public</span>:
  <span class="org-function-name">cercle</span> (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>, <span class="org-type">double</span> <span class="org-variable-name">rayon</span>);
};

<span class="org-constant">cercle</span>::<span class="org-function-name">cercle</span> (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>, <span class="org-type">double</span> <span class="org-variable-name">rayon</span>) : centre(abs, ord), m_rayon(rayon)
{
  ...
}
</pre>
</div>
<p>
propose ainsi une solution. Les constructeurs seront appelés dans l&rsquo;ordre
suivant: <code>point</code>, <code>cercle</code> tandis que les destructeurs seront appelés dans
l&rsquo;ordre inverse.
</p>
</div>

<div id="outline-container-sec-2-0-1" class="outline-4">
<h4 id="sec-2-0-1">Remarques</h4>
<div class="outline-text-4" id="text-2-0-1">
<p>
Il pourrait être envisagé de définir le constructeur de <code>cercle</code> de la façon
suivante:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-constant">cercle</span>::<span class="org-function-name">cercle</span> (<span class="org-type">int</span> <span class="org-variable-name">abs</span>, <span class="org-type">int</span> <span class="org-variable-name">ord</span>, <span class="org-type">double</span> <span class="org-variable-name">rayon</span>) : m_rayon(rayon)
{
  centre = point (abs, ord);
  ...
}
</pre>
</div>

<p>
Cependant, on créerait alors un objet temporaire de type <code>point</code> supplémentaire
provoquant le ralentissement du programme lors de l&rsquo;exécution (<i>a fortiori</i> si
la classe impliquée est de taille conséquente). En outre, si la classe <code>point</code>
dispose de membres dynamiques, <code>p_geometry_type</code> par exemple, seules les valeurs
des pointeurs seront recopiées et non leurs emplacements mémoire. Il conviendra
alors de surcharger l&rsquo;opérateur d&rsquo;affectation <code>=</code> de telle sorte que les membres
pointeurs soient également affectés (<i>cf.</i> Chapitre <a href="lecture_surcharge_operateur.html">&ldquo;Surcharge d&rsquo;opérateur&rdquo;</a>).
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Les objets dynamiques</h2>
<div class="outline-text-2" id="text-3">
<p>
Les objets dynamiques, par opposition aux objets automatiques dont la durée de
vie se limite à l&rsquo;appel d&rsquo;une fonction ou à la taille d&rsquo;un bloc (boucle <code>for</code>,
par exemple), ne sont explicitement détruits qu&rsquo;à l&rsquo;appel de l&rsquo;opérateur
<code>delete</code>. Cette instruction a pour conséquence l&rsquo;exécution du destructeur de la
classe et donc, la désallocation de l&rsquo;espace mémoire réservé. En outre, la
déclaration d&rsquo;objets dynamiques se fait <i>via</i> l&rsquo;opérateur <code>new</code>; le ou les
constructeurs constituent alors le passage obligé lors de la création de
l&rsquo;objet. Plus précisément, après l&rsquo;allocation dynamique de l&rsquo;emplacement mémoire
requis, l&rsquo;opérateur <code>new</code> appellera le constructeur de l&rsquo;objet adéquat selon la
nature des arguments figurant à la suite de son appel. Ainsi, les déclarations
suivantes
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">point</span> * <span class="org-variable-name">ptr_point1</span> = <span class="org-keyword">new</span> <span class="org-type">point</span> ();
<span class="org-type">point</span> * <span class="org-variable-name">ptr_point2</span> = <span class="org-keyword">new</span> <span class="org-type">point</span> (2,5);
</pre>
</div>

<p>
permettront soit l&rsquo;appel du constructeur par défaut (premier cas), soit l&rsquo;appel
du constructeur initialisant les membres de la classe aux valeurs 2 et 5 (second
cas).
</p>

<p>
L&rsquo;accès aux méthodes de l&rsquo;objet pointé <code>ptr_point1</code> ou <code>ptr_point2</code> se fera par
des appels de la forme <code>ptr_point1-&gt;affiche ();</code> équivalents aux instructions de
type <code>(*ptr_point1).affiche();</code>
</p>

<p>
Dès lors que l&rsquo;objet dynamique n&rsquo;est plus nécessaire, l&rsquo;utilisation de
l&rsquo;opérateur <code>delete</code>, indissociable de l&rsquo;opérateur <code>new</code>, entrainera alors
l&rsquo;appel du destructeur de classe.
</p>
</div>
</div>
