lectures/lecture_constructeur.org
* Constructeur de recopie

Nous venons de voir que le \Cpp garantissait l'appel d'un constructeur pour un
objet créé par une déclaration ou par un =new=. Ce point est fondamental
puisqu'il certifie qu'un objet ne pourra être créé sans avoir été placé, au
préalable, dans "un état initial convenable" (du moins jugé comme tel par le
concepteur de l'objet).

Cependant, il existe des circonstances dans lesquelles il est nécessaire de
construire un objet quand bien même le programmeur n'a pas prévu de constructeur
pour cela. La situation la plus fréquente est celle où la valeur d'un objet doit
être transmise en argument à une fonction. Dans ce cas précis, il est
indispensable de créer, dans un emplacement local à la fonction, un objet qui
soit une copie de l'argument effectif. Le même problème se pose dans le cas d'un
objet renvoyé par valeur comme résultat d'une fonction; il faut alors créer un
objet qui soit une copie du résultat. Une troisième situation se rencontre lors
de l'initialisation d'un objet par copie d'un objet du même type.

De manière générale, on regroupe ces trois situations sous le nom
d'*initialisation par recopie* /i.e./ la création d'un objet par recopie d'un
objet existant de même type. Pour réaliser une telle opération, \Cpp a prévu
d'utiliser un constructeur particulier dit *constructeur de recopie*. En
l'absence d'un tel constructeur, un traitement par défaut est prévu. Toutefois,
ce comportement par défaut, se contente d'effectuer une copie de chacun des
membres de la classe. On retrouve ainsi une situation analogue à celle qui est
mise en place (par défaut) lors d'une affectation entre objets de même type. Le
problème se pose alors pour des objets contenant des pointeurs sur des
emplacements dynamiques. Par défaut, seules les valeurs des pointeurs seront
recopiées, les emplacements pointées ne le seront pas.

Afin de conserver les espaces mémoires alloués, il est possible de fournir
explicitement, dans la classe, un constructeur de recopie. Il s'agit d'un
constructeur disposant d'un seul argument du type de la classe et transmis
obligatoirement par référence. Son entête doit donc être de l'une de ces deux
formes :

#+BEGIN_SRC c++
  point(point& the_point);
#+END_SRC
ou
#+BEGIN_SRC c++
  point(const point& the_point);
#+END_SRC

C'est à ce constructeur et donc au concepteur de la classe, de prendre en charge
l'intégralité du travail de copie : copie superficielle c'est-à-dire copie des
membres et copie profonde à savoir copie des espaces alloués dynamiquement. Le
code suivant fournit un exemple d'implémentation de constructeur de recopie

#+BEGIN_SRC c++
  class point
  {
  private :
    int m_X;
    int m_Y;
    char *p_geometry_type;

  public :
    point();
    point(const point& the_point);
    ~point();
  };

  point::point(const point& the_point)
  {
    // Copie superficielle
    m_X = the_point.m_X;
    m_Y = the_point.m_Y;
    // Copie profonde
    if (the_point.p_geometry_type) {
      p_geometry_type = new char[strlen(the_point.p_geometry_type) + 1];
      strcpy(p_geometry_type, the_point.p_geometry_type);
    }
  }
#+END_SRC


*** Remarques

- Le \Cpp impose au constructeur par recopie que son unique argument soit
  transmis par référence ce qui relève d'une logique implacable puisque, dans le
  cas contraire, l'appel du constructeur de recopie impliquerait une
  intialisation par recopie de l'argument et donc un appel du constructeur de
  recopie qui, lui même, etc etc etc. Quoiqu'il en soit la forme =point(point
  the_point);= serait rejetée lors de la compilation.

- Les deux formes précédentes =point(point& the_point)= et =point (const point&
  the_point)= peuvent exister au sein d'une même classe. Dans ce cas, la
  première serait utilisée en cas d'initialisation par un objet quelconque
  tandis que la seconde serait utilisée en cas d'initialisation par un objet
  constant. En général, comme un tel constructeur de recopie n'a logiquement
  aucune raison de vouloir modifier l'objet reçu en argument, il est conseillé
  de ne définir que la seconde forme qui restera ainsi applicable aux deux
  situations évoquées.

- Bien que l'initialisation par recopie et l'affectation présente un traitement
  par défaut semblable (copie superficielle), la prise en compte d'une copie
  profonde passe par des mécanismes différents : définition d'un constructeur de
  recopie pour l'initialisation, surdéfinition de l'opérateur === pour
  l'affectation (/cf./ Chapitre [[file:lecture_surcharge.pdf]["Surcharge d'opérateur"]]).
