doc/lectures/lecture_constructeur.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Constructeur de recopie</h2>
<div class="outline-text-2" id="text-4">
<p>
Nous venons de voir que le C++ garantissait l&rsquo;appel d&rsquo;un constructeur pour un
objet créé par une déclaration ou par un <code>new</code>. Ce point est fondamental
puisqu&rsquo;il certifie qu&rsquo;un objet ne pourra être créé sans avoir été placé, au
préalable, dans &ldquo;un état initial convenable&rdquo; (du moins jugé comme tel par le
concepteur de l&rsquo;objet).
</p>

<p>
Cependant, il existe des circonstances dans lesquelles il est nécessaire de
construire un objet quand bien même le programmeur n&rsquo;a pas prévu de constructeur
pour cela. La situation la plus fréquente est celle où la valeur d&rsquo;un objet doit
être transmise en argument à une fonction. Dans ce cas précis, il est
indispensable de créer, dans un emplacement local à la fonction, un objet qui
soit une copie de l&rsquo;argument effectif. Le même problème se pose dans le cas d&rsquo;un
objet renvoyé par valeur comme résultat d&rsquo;une fonction; il faut alors créer un
objet qui soit une copie du résultat. Une troisième situation se rencontre lors
de l&rsquo;initialisation d&rsquo;un objet par copie d&rsquo;un objet du même type.
</p>

<p>
De manière générale, on regroupe ces trois situations sous le nom
d&rsquo;<b>initialisation par recopie</b> <i>i.e.</i> la création d&rsquo;un objet par recopie d&rsquo;un
objet existant de même type. Pour réaliser une telle opération, C++ a prévu
d&rsquo;utiliser un constructeur particulier dit <b>constructeur de recopie</b>. En
l&rsquo;absence d&rsquo;un tel constructeur, un traitement par défaut est prévu. Toutefois,
ce comportement par défaut, se contente d&rsquo;effectuer une copie de chacun des
membres de la classe. On retrouve ainsi une situation analogue à celle qui est
mise en place (par défaut) lors d&rsquo;une affectation entre objets de même type. Le
problème se pose alors pour des objets contenant des pointeurs sur des
emplacements dynamiques. Par défaut, seules les valeurs des pointeurs seront
recopiées, les emplacements pointées ne le seront pas.
</p>

<p>
Afin de conserver les espaces mémoires alloués, il est possible de fournir
explicitement, dans la classe, un constructeur de recopie. Il s&rsquo;agit d&rsquo;un
constructeur disposant d&rsquo;un seul argument du type de la classe et transmis
obligatoirement par référence. Son entête doit donc être de l&rsquo;une de ces deux
formes :
</p>

<div class="org-src-container">

<pre class="src src-c++">point (point&amp; the_point);
</pre>
</div>
<p>
ou
</p>
<div class="org-src-container">

<pre class="src src-c++">point (<span class="org-keyword">const</span> <span class="org-type">point</span>&amp; <span class="org-variable-name">the_point</span>);
</pre>
</div>

<p>
C&rsquo;est à ce constructeur et donc au concepteur de la classe, de prendre en charge
l&rsquo;intégralité du travail de copie : copie superficielle c&rsquo;est-à-dire copie des
membres et copie profonde à savoir copie des espaces alloués dynamiquement. Le
code suivant fournit un exemple d&rsquo;implémentation de constructeur de recopie
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">point</span>
{
<span class="org-keyword">private</span> :
  <span class="org-type">int</span> <span class="org-variable-name">m_X</span>;
  <span class="org-type">int</span> <span class="org-variable-name">m_Y</span>;
  <span class="org-type">char</span> *<span class="org-variable-name">p_geometry_type</span>;

<span class="org-keyword">public</span> :
  <span class="org-function-name">point</span> ();
  <span class="org-function-name">point</span> (<span class="org-keyword">const</span> <span class="org-type">point</span>&amp; <span class="org-variable-name">the_point</span>);
  ~<span class="org-function-name">point</span> ();
};

<span class="org-constant">point</span>::<span class="org-function-name">point</span> (<span class="org-keyword">const</span> <span class="org-type">point</span>&amp; <span class="org-variable-name">the_point</span>)
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">Copie superficielle</span>
  m_X = the_point.m_X;
  m_Y = the_point.m_Y;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Copie profonde</span>
  <span class="org-keyword">if</span> (the_point.p_geometry_type) {
    p_geometry_type = <span class="org-keyword">new</span> <span class="org-type">char</span>[strlen(the_point.p_geometry_type) + 1];
    strcpy(p_geometry_type, the_point.p_geometry_type);
  }
}
</pre>
</div>
</div>


<div id="outline-container-sec-4-0-1" class="outline-4">
<h4 id="sec-4-0-1">Remarques</h4>
<div class="outline-text-4" id="text-4-0-1">
<ul class="org-ul">
<li>Le C++ impose au constructeur par recopie que son unique argument soit
transmis par référence ce qui relève d&rsquo;une logique implacable puisque, dans le
cas contraire, l&rsquo;appel du constructeur de recopie impliquerait une
intialisation par recopie de l&rsquo;argument et donc un appel du constructeur de
recopie qui, lui même, etc etc etc. Quoiqu&rsquo;il en soit la forme <code>point (point
  the_point);</code> serait rejetée lors de la compilation.
</li>

<li>Les deux formes précédentes <code>point (point&amp; the_point)</code> et <code>point (const point&amp;
  the_point)</code> peuvent exister au sein d&rsquo;une même classe. Dans ce cas, la
première serait utilisée en cas d&rsquo;initialisation par un objet quelconque
tandis que la seconde serait utilisée en cas d&rsquo;initialisation par un objet
constant. En général, comme un tel constructeur de recopie n&rsquo;a logiquement
aucune raison de vouloir modifier l&rsquo;objet reçu en argument, il est conseillé
de ne définir que la seconde forme qui restera ainsi applicable aux deux
situations évoquées.
</li>

<li>Bien que l&rsquo;initialisation par recopie et l&rsquo;affectation présente un traitement
par défaut semblable (copie superficielle), la prise en compte d&rsquo;une copie
profonde passe par des mécanismes différents : définition d&rsquo;un constructeur de
recopie pour l&rsquo;initialisation, surdéfinition de l&rsquo;opérateur <code>=</code> pour
l&rsquo;affectation (<i>cf.</i> Chapitre <a href="lecture_surcharge.html">&ldquo;Surcharge d&rsquo;opérateur&rdquo;</a>).
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
